package parking;

public class MakingPlan {
//	주차장 입출고 프로그램 만들기
	
//	1. 안녕하세요 00주차장입니다. 현재 잔여 주차자리는 ? 자리입니다. ++1,2,3,장애인 주차구역 구별할 수 있으면 해보기
//		1. 주차장 이용자입니다.
//		2. 주차장 관리자입니다.(로그인 Id, Pw는 관리자 테이블 새로만들기)
	
//	2. 사용자 계정과 관리자 계정 따로 구분, 
//	   사용자 계정의 경우 1. 입차하기 (차량번호(not null), 주차위치(not null), 입차시간(db에서 들어가게), 특이사항 )
//	   				  2. 내 차량조회(1대) , 조회의 경우차량번호로 차량위치, 입차시간, 현재시간, 주차요금 출력되도록
//	   				  3. 출차하기,  차량위치, 입차시간, 현재시간, 주차요금 출력되도록
//					  4. 시작페이지로 돌아가기
	
//	   관리자 계정의 경우 1. 입고된 차량 목록
//	   				  2. 차량조회(1대) , 조회의 경우차량번호로 차량위치, 입차시간, 현재시간, 주차요금 출력되도록
//	   				  3. 출차하기,  차량위치, 입차시간, 현재시간, 주차요금 출력되도록
//	   				  4. 차량번호로 차량위치 수정, 입차시간 수정, 특이사항 수정
//					  5. 시작페이지로 돌아가기
//					  6. 시스템 종료
//	3. 차량 위치의 경우 1구역, 2구역, 3구역과 장애인구역 구분 할수있으면 해보기
}
